Revit 2027 API
BuiltInFailures.SketchFailures.TrussMissingReference Property
 Trusses require both a top and a bottom chord reference (chain of one or more reference lines).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussMissingReference { get; }
Public Shared ReadOnly Property TrussMissingReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussMissingReference {
	FailureDefinitionId^ get ();
}
static member TrussMissingReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace